Nerdiyde/ESP32_Neomatrix_GIF_display/ESP32_Neomatrix_GIF_display/neomatrix_config.h
#ifndef neomatrix_config_h
#define neomatrix_config_h

/*
  Yes, this file is a bit complicated looking, that's because it supports lots
  of different hardware backends (listed below). A single define will let you
  switch from one backend to another one without changing your code.
  If you'd like to see this file (likely out of date somewhat) with a bunch of
  defines removed, so it looks more flat, see neomatrix_config_tftonly.h
  But this big file is the one I'll maintain instead of maintaining 5 or more
  separate files, one per backend, when most of the code/init can be shared
  between them.

  All backends end up using the same Framebuffer::GFX as the base class
  but SmartMatrix is sufficiently different to need its own exceptions and handling
  (for one, with SmartMatrix, the buffer is actually handled by SmartMatrix whereas
  the other libraries define their own FastLED CRGB buffer (RGB888) ).

  Backends you should choose from (define 1):
  - SMARTMATRIX (if you are using the old SMARTMATRIX3, also define SMARTMATRIXV3)
  - ILI9341
  - ST7735_128b160
  - ST7735_128b128
  - SSD1331 (96x64 TFT)
  - Everything below is NeoMatrix in different patterns:
  MATRIX_SIZE_24X24 MATRIX_SIZE_32X8_3_TIMES MATRIX_SIZE_16X16_4_TILES MATRIX_SIZE_64X64 are 4 examples of NEOMATRIX defines
  (3 tiled 32x8, 4 tiled 16x16, and a single zigzag 64x64 array)
  - ARDUINOONPC is auto defined by https://github.com/marcmerlin/ArduinoOnPc-FastLED-GFX-LEDMatrix
  - On ARM, we assume rPi and define RPIRGBPANEL
  - Elsewhere, we assume rendering on linux/X11
    - LINUX_RENDERER_X11 is the default with ArduinoOnPc-FastLED-GFX-LEDMatrix
    - LINUX_RENDERER_SDL can be defined in ArduinoOnPc-FastLED-GFX-LEDMatrix's Makefile

  // For TFTs, there is original support from adafruit, but https://github.com/moononournation/Arduino_GFX/
  // has better and faster support for many TFTs (ILI9341, ST7735*, SSD1331, etc...)
  // define ADAFRUIT_TFT if you'd rather have the Adafruit drivers. I don't recommend them anymore.

  LEDMATRIX is a separate define you'd set before including this file and
  adds the LEDMatrix API if you need it.
  The TL;DR is you shouldn't bother with it if you already have the GFX
  and FastLED APIs, unless you can use fancy wavy scrolling colored fonts or the
  sprite support in LEDMatrix.

  You should not need to modify this file at all unless you are adding new matrix
  definitions and/or changing pin mappings for TFT screens. To choose which backend
  to use, set the define before you include the file.
*/

// vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv
// README README README README README README README README README README  README README README README
// If you have never used FastLED::NeoMatrix before, please try these 2 examples first
// https://github.com/marcmerlin/FastLED_NeoMatrix/tree/master/examples/matrixtest
// https://github.com/marcmerlin/FastLED_NeoMatrix/tree/master/examples/MatrixGFXDemo
// For FastLED just uncomment this line below (define MATRIX_SIZE_24X24) and fix the matrix definition
// or use one of the other ones if they are closer ot your setup (MATRIX_SIZE_32X8_3_TIMES MATRIX_SIZE_16X16_4_TILES MATRIX_SIZE_64X64.
// For SmartMatrix, just use "#define SMARTMATRIX"
//
// Are all those defines confusing? Then look at neomatrix_config_tftonly.h with all the defines
// taken out and a single backend hardcoded.
// ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
//#define MATRIX_SIZE_24X24

// If you did not define something above, right here ^^^ the code below will look at the
// chip and do a hardcoded define that works for me, but is unlikely to be what you are also
// using, so really you want to define your driver above, or one will be picked for you and
// it'll probably be the wrong one :)
/*
  #if !defined(MATRIX_SIZE_16X16) && !defined(MATRIX_SIZE_24X24) && !defined(MATRIX_SIZE_32X8_3_TIMES) && !defined(MATRIX_SIZE_16X16_4_TILES) && !defined(MATRIX_SIZE_32X32_4_TILES) && !defined(PXLBLCK_32X32_FROM_4_16X16_TILES) && !defined(MATRIX_SIZE_64X64) && !defined(SMARTMATRIX) && !defined(SSD1331) && !defined(ST7735_128b128) && !defined(ST7735_128b160) && !defined(ILI9341) && !defined(ARDUINOONPC)

  #ifdef ESP8266
  //#define MATRIX_SIZE_32X8_3_TIMES
  //#define MATRIX_SIZE_16X16_4_TILES
  #endif
*/
/*
  #ifdef ESP32
  //#define MATRIX_SIZE_64X64
  #endif
*/

/*
  // Teensy 3.6
  #ifdef __MK66FX1M0__
  #define ILI9341
  // If instead you are using the old SmartMatrix V3, define those 2
  //#define SMARTMATRIX3
  // And with SmartMatrix (v4), only this define is needed.
  //#define SMARTMATRIX
  #endif
*/


/*
  // Teensy v.4
  #ifdef __IMXRT1062__
  //#define SMARTMATRIX3
  #define SMARTMATRIX
  #endif
*/

//#endif
/*
  #if defined(ARDUINOONPC)
  // Those defines (including RPIRGBPANEL) come from makeNativeArduino.mk
  #if defined(RPI4)
  #pragma message "Detected ARDUINOONPC on rPi4, RPIRGBPANEL defined and will use FastLED_RPIRGBPanel_GFX"
  #elif defined(RPI3)
  #pragma message "Detected ARDUINOONPC on rPi3, RPIRGBPANEL defined and will use FastLED_RPIRGBPanel_GFX"
  #elif defined(RPILT3)
  #pragma message "Detected ARDUINOONPC on pre-rPi3, RPIRGBPANEL defined and will use FastLED_RPIRGBPanel_GFX"
  #else
  #ifndef LINUX_RENDERER_SDL
  #pragma message "Detected ARDUINOONPC. Using LINUX_RENDERER_X11 FastLED_TFTWrapper_GFX Rendering"
  #define LINUX_RENDERER_X11
  #else
  #pragma message "Detected ARDUINOONPC. Using LINUX_RENDERER_SDL FastLED_NeoMatrix Rendering."
  #pragma message "Comment out LINUX_RENDERER_SDL for X11 rendering instead of SDL. Use + for brighter."
  #endif
  #endif
  #endif*/



#include <Adafruit_GFX.h>
bool init_done = 0;
uint32_t tft_spi_speed;
#define ARRAY_SIZE(A) (sizeof(A) / sizeof((A)[0]))

// min/max are complicated. Arduino and ESP32 layers try to be helpful by using
// templates that take specific kinds of arguments, but those do not always work
// with mixed types:
// error: no matching function for call to 'max(byte&, int16_t&)'
// These defines get around this problem.
#define mmin(a,b) ((a<b)?(a):(b))
#define mmax(a,b) ((a>b)?(a):(b))

// The ESP32 FastLED defines below must be defined before FastLED.h is loaded
// They are not relevant if you don't actually use FastLED pixel output but cause
// no harm if we only include FastLED for its CRGB struct.
#ifdef ESP32
  // Allow infrared for old FastLED versions
  #define FASTLED_ALLOW_INTERRUPTS 1
  // Newer Samguyver ESP32 FastLED has a new I2S implementation that can be
  // better (or worse) than then default RMT which only supports 8 channels.
  #define FASTLED_ESP32_I2S
  #pragma message "Please use https://github.com/samguyer/FastLED.git if stock FastLED is unstable with ESP32"
#endif //ESP32

#include <FastLED.h>
/*
  #ifdef LEDMATRIX
  // Please use https://github.com/marcmerlin/LEDMatrix/ at least as recent as
  // https://github.com/marcmerlin/LEDMatrix/commit/597ce703e924d45b2e676d6558c4c74a8ebc6991
  // or https://github.com/Jorgen-VikingGod/LEDMatrix/commit/a11e74c8cd5b933021b6e15eb067280a52691449
  // zero copy/no malloc code to work.
  #include <LEDMatrix.h>
  #endif //LEDMATRIX
*/


//============================================================================
// Ok, if you're doing matrices of displays, there is also a reasonable chance
// you'll be using SPIFFS or FATFS on flash, or an sdcard, so let's define it
// here (NeoMatrix-FastLED-IR actually also uses this to read a config file)
//============================================================================

// Note, you can use an sdcard on ESP32 or ESP8266 if you really want,
// but if your data fits in built in flash, why not use it?
// Use built in flash via SPIFFS/FATFS
// esp8266com/esp8266/libraries/SD/src/File.cpp
// ESP8266: http://esp8266.github.io/Arduino/versions/2.3.0/doc/filesystem.html#uploading-files-to-file-system
// ESP32: https://github.com/me-no-dev/arduino-esp32fs-plugin
// https://github.com/marcmerlin/esp32_fatfsimage/blob/master/README.md

